"""
Задача №4
Користувач вводить рядок,
в якому можуть бути присутні пропуски.
Визначити, чи є рядок паліндромом,
тобто таким, який однаково читається як справа наліво,
так і зліва направо. Для літер регістр не враховувати.
Приклади рядків-паліндромів: racecar, 10201, Ada, Never odd or even
Автор: Задворна Анастасія Богданівна
"""

text = input ("Введіть рядок: ")
text = text.replace(" ", '')
text = text.lower()
print(text == text[::-1])
