"""
Задача №1
Мама спекла пиріг з яблуками,
в якому було 60% яблук, а решта - тісто.
При цьому 30% тіста становили яйця і цукор,
решта - борошно.
Вся маса пирога дорівнює m кг.
Яка маса борошна в пирозі в грамах?
Автор: Задворна Анастасія Богданівна
"""

m = input('Маса пирога: ')
tisto = 0.4 * int(m)
boroshno = tisto * 0.7
res = boroshno * 1000
print(res) 
